taurus/scripts/execution.yml
execution:
- concurrency: 2  
  ramp-up: 30s
  hold-for: 1m
  scenario: reach-home-page-jmeter-test

scenarios:
  reach-home-page-jmeter-test:
    data-sources:
    - test_data.csv
    store-cache: true
    store-cookie: true
    think-time: 1s
    timeout: 500ms
    keepalive: true
    retrieve-resources: true
    concurrent-pool-size: 4
    use-dns-cache-mgr: true
    requests:
      - url: ${host}
        method: GET
        label: homepage
        assert:
          - contains:
            - British Broadcasting Corporation
            subject: body # subject for search
            regexp: true # treat string as regular expression
            not: false # invert condition - fail if found
            assume-success: false # mark sample successful before asserting it
        jsr223: log.info("Test message for logs") # inline script to execute, unless script-file is specified
      - url: ${host}${path_news}
        method: GET
        label: news
      - url: ${host}${path_news}${path_news_world}
        method: GET
        label: world